weapon = {
    "12": {
        "破坏石数量": 1144,
        "突破石数量": 24,
        "融合材料数量": 14,
        "碎片数量": 422,
        "手续费": 680,
        "第一次强化的成功率": 0.1,
        "每次失败系统赠送成功率": 0.01,
        "太阳之恩典额外成功率": 0.139 / 100,
        "太阳之祝福额外成功率": 0.139 * 2 / 100,
        "太阳之庇护额外成功率": 0.139 * 6 / 100,
        "太阳之恩典最大值": 24,
        "太阳之祝福最大值": 12,
        "太阳之庇护最大值": 4
    },
    "13": {
        "破坏石数量": 1144,
        "突破石数量": 28,
        "融合材料数量": 16,
        "碎片数量": 572,
        "手续费": 680,
        "第一次强化的成功率": 0.05,
        "每次失败系统赠送成功率": 0.005,
        "太阳之恩典额外成功率": 0.0463 / 100,
        "太阳之祝福额外成功率": 0.0463 * 2 / 100,
        "太阳之庇护额外成功率": 0.0463 * 6 / 100,
        "太阳之恩典最大值": 36,
        "太阳之祝福最大值": 18,
        "太阳之庇护最大值": 6
    },
    "14": {
        "破坏石数量": 1300,
        "突破石数量": 30,
        "融合材料数量": 18,
        "碎片数量": 776,
        "手续费": 710,
        "第一次强化的成功率": 0.05,
        "每次失败系统赠送成功率": 0.005,
        "太阳之恩典额外成功率": 0.0463 / 100,
        "太阳之祝福额外成功率": 0.0463 * 2 / 100,
        "太阳之庇护额外成功率": 0.0463 * 6 / 100,
        "太阳之恩典最大值": 36,
        "太阳之祝福最大值": 18,
        "太阳之庇护最大值": 6
    }
}

clothe = {
    "11": {
        "守护石数量": 686,
        "突破石数量": 14,
        "融合材料数量": 10,
        "碎片数量": 216,
        "手续费": 350,
        "第一次强化的成功率": 0.1,
        "每次失败系统赠送成功率": 0.01,
        "太阳之恩典额外成功率": 0.139 / 100,
        "太阳之祝福额外成功率": 0.139 * 2 / 100,
        "太阳之庇护额外成功率": 0.139 * 6 / 100,
        "太阳之恩典最大值": 24,
        "太阳之祝福最大值": 12,
        "太阳之庇护最大值": 4
    },
    "12": {
        "守护石数量": 686,
        "突破石数量": 16,
        "融合材料数量": 10,
        "碎片数量": 292,
        "手续费": 350,
        "第一次强化的成功率": 0.1,
        "每次失败系统赠送成功率": 0.01,
        "太阳之恩典额外成功率": 0.139 / 100,
        "太阳之祝福额外成功率": 0.139 * 2 / 100,
        "太阳之庇护额外成功率": 0.139 * 6 / 100,
        "太阳之恩典最大值": 24,
        "太阳之祝福最大值": 12,
        "太阳之庇护最大值": 4
    }
}